# Ejemplo aplicaci√≥n lambda function, apply() y DataFrame

Ver tutorial https://www.analyticsvidhya.com/blog/2021/10/lambda-function-a-better-understanding/

In [1]:
#importing libraries
import pandas as pd
#creating dataframe
data = pd.DataFrame({
    'S.No':[1,2,3,4,5],
    'name':['Anand','Ramesh','Surya','Dinesh','Dhamu'],
    'expert':['ML','DS','Network','Banking','Electronics'],
    'income':[45000,50000,75000,80000,85000],
    'place':['Cheyyar','Chennai','Bangalore','Malaysia','Cheannai'],
    'Experience':[3,2,10,9,5]
})
data

   S.No    name       expert  income      place  Experience
0     1   Anand           ML   45000    Cheyyar           3
1     2  Ramesh           DS   50000    Chennai           2
2     3   Surya      Network   75000  Bangalore          10
3     4  Dinesh      Banking   80000   Malaysia           9
4     5   Dhamu  Electronics   85000   Cheannai           5

In [2]:
data['income'] = data.apply(lambda i: i['income']+5500, axis=1)
data

   S.No    name       expert  income      place  Experience
0     1   Anand           ML   50500    Cheyyar           3
1     2  Ramesh           DS   55500    Chennai           2
2     3   Surya      Network   80500  Bangalore          10
3     4  Dinesh      Banking   85500   Malaysia           9
4     5   Dhamu  Electronics   90500   Cheannai           5

In [3]:
#filter function for segregation from the dataframe
list(filter(lambda i: i>5, data['Experience']))
[10, 9]

[10, 9]

In [4]:
#map() function
data['income']=list(map(lambda i: int(i+i*0.15),data['income']))
data

   S.No    name       expert  income      place  Experience
0     1   Anand           ML   58075    Cheyyar           3
1     2  Ramesh           DS   63825    Chennai           2
2     3   Surya      Network   92575  Bangalore          10
3     4  Dinesh      Banking   98325   Malaysia           9
4     5   Dhamu  Electronics  104075   Cheannai           5

In [5]:
import functools
functools.reduce(lambda a,b: a+b,data['income'])
479404

479404

In [7]:
data['category']=data['Experience'].apply(lambda x: 'Expert level' if
  x>=5 else 'Begineer')
data

   S.No    name       expert  income      place  Experience      category
0     1   Anand           ML   58075    Cheyyar           3      Begineer
1     2  Ramesh           DS   63825    Chennai           2      Begineer
2     3   Surya      Network   92575  Bangalore          10  Expert level
3     4  Dinesh      Banking   98325   Malaysia           9  Expert level
4     5   Dhamu  Electronics  104075   Cheannai           5  Expert level

In [10]:
#lambda in user defined 
def ads(x):
    return(lambda y:x+y)

a = ads(4)
print(a(8))

12